trade_exp/src/Documents/УстановкаНормРабочегоВремени/УстановкаНормРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8e8e3a99-4197-4280-a1f3-12402d9c85fa">
  <name>УстановкаНормРабочегоВремени</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="678a368a-6569-4249-a67b-9d9d52a7c1a7">
    <name>ПериодРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7c7a1f9a-8902-4a61-9596-ae0346c08881">
    <name>Отдел</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ca42623-3edd-4fc3-9f1d-669c3057875e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="339dae12-eda4-411a-94b9-a14457544bbc">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8ffb191e-1568-448f-bc7e-e5a6b0ba4c83">
    <name>НормаЧасовВМесяцНаСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d293afe-ebfd-47af-81aa-77c4c6bf16c6">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08796fea-c01e-438f-a2e7-9c40e5ac3b87">
    <name>КоличествоЧеловекВОтделе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="3a3d5c47-777c-483a-9aa4-30bd20af3ab9">
    <name>НормыВремени</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e0bf11f9-fc55-4b3e-8ef1-538fd56c8bcb">
      <name>ДеньНедели</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>1</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9953016e-1b61-4528-b677-a7549a34f908">
      <name>ДеньНеделиСтрокой</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>11</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a22a012e-7c74-479f-808a-fc0d70b5f334">
      <name>ЧасыРаботыОрганизацииВДень</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a2edfb04-3d3f-497e-b85e-ff548fa14cb9">
      <name>КоличествоЧеловек</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fb8e5cb7-6c46-4091-8726-9b519017d6b0">
      <name>НормаЧасовРаботыНаЧеловекаВДень</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>1</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/УстановкаНормРабочегоВремени/Forms/ФормаДокумента/Module.bsl
////////////////////// События формы /////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Объект.ПериодРегистрации= НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	МесяцРегистрацииСтрокой= УчетРабочегоВремениСервер.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор= Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

////////////////////// События элементов /////////////////////////////
&НаКлиенте
Процедура ОтделПриИзменении(Элемент)
	ОтделПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПериодРегистрацииНачалоВыбораЗавершение", ЭтаФорма);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("РедактируемыйОбъект", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПутьРеквизита", "Объект.ПериодРегистрации");
	ДополнительныеПараметры.Вставить("ПутьРеквизитаПредставления", "МесяцРегистрацииСтрокой");
	ДополнительныеПараметры.Вставить("ИзменитьМодифицированность", Истина);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	
	Значение = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтаФорма, "Объект.ПериодРегистрации");
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
	Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Значение, "Месяц", Ложь),
	ЭтаФорма, , , ,ОповещениеЗавершения , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	Объект.ПериодРегистрации= ЗначениеВыбрано;
	МесяцРегистрацииСтрокой= УчетРабочегоВремениКлиент.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура МесяцРегистрацииСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцРегистрацииСтрокой= УчетРабочегоВремениКлиент.ПолучитьПредставлениеМесяца(Объект.ПериодРегистрации);
КонецПроцедуры


////////////////////// Команды /////////////////////////////
&НаКлиенте
Процедура Рассчитать(Команда)
	Если Объект.НормыВремени.Количество() < 7 Тогда
		Сообщить("Необходимо предворительно заполнить нормы по всем дням недели!");
		Возврат;
	КонецЕсли;
	
	РасчитатьКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ДиалогСВопросомОчиститьДанные();
КонецПроцедуры

////////////////////// Вспомогательные функции /////////////////////////////
&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюКлиент()
	Объект.НормыВремени.Очистить();
	мРасписание= УчетРабочегоВремениСервер.ПолучитьЧасыработыОрганизации(Объект.ГрафикРаботы);
	Для ДН=1 По 7 Цикл
		НоваяСтрока= Объект.НормыВремени.Добавить();
		НоваяСтрока.ДеньНедели= ДН;
		НоваяСтрока.ДеньНеделиСтрокой= АльтерраОбщегоНазначения.ДеньНеделиПрописьюСокр(НоваяСтрока.ДеньНедели);
		НоваяСтрока.ЧасыРаботыОрганизацииВДень= мРасписание[ДН-1];
		НоваяСтрока.КоличествоЧеловек= Объект.КоличествоЧеловекВОтделе;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьКлиент()
	КолБудней= УчетРабочегоВремениСервер.ПолучитьКоличествоДнейВМесяц(Объект.ПериодРегистрации, КонецМесяца(Объект.ПериодРегистрации), ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий"));
	КолСуббот= УчетРабочегоВремениСервер.ПолучитьКоличествоДнейВМесяц(Объект.ПериодРегистрации, КонецМесяца(Объект.ПериодРегистрации), ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота"));
	КолВоскресений= УчетРабочегоВремениСервер.ПолучитьКоличествоДнейВМесяц(Объект.ПериодРегистрации, КонецМесяца(Объект.ПериодРегистрации), ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье"));
	КолПраздников= УчетРабочегоВремениСервер.ПолучитьКоличествоДнейВМесяц(Объект.ПериодРегистрации, КонецМесяца(Объект.ПериодРегистрации), ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный"));
	
	РобочиеЧасыВДеньСБ= Объект.НормыВремени[6-1].ЧасыРаботыОрганизацииВДень;
	РобочиеЧасыВДеньВС= Объект.НормыВремени[7-1].ЧасыРаботыОрганизацииВДень;
	КоличествоЧеловекСБ= Объект.НормыВремени[6-1].КоличествоЧеловек;
	КоличествоЧеловекВС= Объект.НормыВремени[7-1].КоличествоЧеловек;
	КоличествоЧеловекБудни= Объект.НормыВремени.Итог("КоличествоЧеловек")-КоличествоЧеловекСБ-КоличествоЧеловекВС;
	
	
	Для ДН=1 По 7 Цикл
		ТекущаяСтрока= Объект.НормыВремени[ДН-1];
		Если ТекущаяСтрока.ДеньНедели < 6 Тогда
			НормаЧасовРаботыНаЧеловекаВДень= (КолБудней*Объект.НормаЧасовВМесяцНаСотрудника-(КолСуббот*РобочиеЧасыВДеньСБ*КоличествоЧеловекСБ+КолВоскресений*РобочиеЧасыВДеньВС*КоличествоЧеловекВС))/КоличествоЧеловекБудни/КолБудней;
			ТекущаяСтрока.НормаЧасовРаботыНаЧеловекаВДень= НормаЧасовРаботыНаЧеловекаВДень;
		ИначеЕсли ТекущаяСтрока.ДеньНедели = 6 Тогда
			ТекущаяСтрока.НормаЧасовРаботыНаЧеловекаВДень= ТекущаяСтрока.ЧасыРаботыОрганизацииВДень;
		ИначеЕсли ТекущаяСтрока.ДеньНедели = 7 Тогда
			ТекущаяСтрока.НормаЧасовРаботыНаЧеловекаВДень= ТекущаяСтрока.ЧасыРаботыОрганизацииВДень;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДиалогСВопросомОчиститьДанные()
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	ЭтаФорма);	
	
	ПоказатьВопрос(Оповещение,
	"Очистить введенные данные?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Очистить?" // (необ.) заголовок
	);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт		
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоУмолчаниюКлиент();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтделПриИзмененииСервер()
Объект.КоличествоЧеловекВОтделе= УчетРабочегоВремениСервер.ПолучитьКоличествоСотрудниковВПодразделении(Объект.Подразделение);
Объект.ГрафикРаботы= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Отдел, "ГрафикРаботы");
КонецПроцедуры
